<?php
/*
|--------------------------------------------------------------------------
| エラーコード&メッセージ
|--------------------------------------------------------------------------
*/
return [
    'I_0000000' => 'Success',
    'E_0000000' => 'エラー',
    'E_0000001' => ':sampleエラー',
    'V_0000000' => 'バリデーションエラー',
    'W_0000000' => 'ワーニング',


    'E_500_0000001' => '新規登録に失敗しました。',
    'E_500_0000002' => '更新に失敗しました。',
    'E_500_0000003' => '削除に失敗しました。',
    'E_503_0000001' => 'APIサーバからさらに先の通信先サーバとの接続に失敗しました。',

    'E_400_0000001' => '適用開始日が適用終了日よりも未来の日付です。',
    'E_400_0000002' => '配送端末ホスト情報の、配送端末ホスト名またはIPアドレスが重複しています。',
    'E_400_0000003' => '端末情報の、IPアドレスが重複しています。',

    'E_401_0000000' => 'ログイン認証に失敗しました。ID、パスワードをご確認ください。',
    'E_401_0000001' => '認証期限が切れました。',

    'E_404_0000002' => 'ご指定の郵便番号は存在しませんでした。',

    'E_204_0000001' => 'お探しの郵便番号は見つかりませんでした。',
    'E_204_0000003' => '条件に合致する端末は見つかりませんでした。',
];
